test/integration/helpers/fixtures/offline-payment-update.json

[
    {
        "scope": "https://api.railz.io:443",
        "method": "POST",
        "path": "/v1/recipients",
        "body": {
            "type": "individual",
            "firstName": "Tom",
            "lastName": "Jones",
            "email": "testEmail@example.com",
            "address": {
                "street1": "123 Wolfstrasse",
                "city": "Berlin",
                "country": "DE",
                "postalCode": "123123"
            }
        },
        "status": 200,
        "response": {
            "ok": true,
            "recipient": {
                "id": "R-Jcw11J3yhCUR771KpA87Zz",
                "referenceId": "R-Jcw11J3yhCUR771KpA87Zz",
                "parentRecipientId": null,
                "email": "testEmail@example.com",
                "name": "Tom Jones",
                "lastName": "Jones",
                "firstName": "Tom",
                "legalName": "",
                "type": "individual",
                "status": "incomplete",
                "language": "en",
                "complianceStatus": "pending",
                "dob": null,
                "passport": "",
                "placeOfBirth": null,
                "updatedAt": "2022-10-25T04:56:26.232Z",
                "createdAt": "2022-10-25T04:56:26.232Z",
                "tags": [],
                "isPortalUser": false,
                "taxDeliveryType": "mail",
                "contactEmails": [],
                "occupation": "",
                "address": {
                    "street1": "123 Wolfstrasse",
                    "street2": "",
                    "city": "Berlin",
                    "postalCode": "123123",
                    "country": "DE",
                    "region": null,
                    "phone": "",
                    "phoneValidated": false
                },
                "compliance": {
                    "status": "pending",
                    "checkedAt": null
                },
                "gravatarUrl": "https://www.gravatar.com/avatar/47891e3b30e9fe3c5355801d4cbd5896?d=404",
                "governmentId": null,
                "ssn": null,
                "governmentIds": [],
                "birthplace": {
                    "country": null,
                    "region": null,
                    "city": null
                },
                "citizenships": [],
                "routeType": "sepa",
                "routeMinimum": "0",
                "estimatedFees": "4",
                "accounts": [],
                "payoutMethod": null,
                "primaryCurrency": null,
                "riskScore": null,
                "merchantId": "M-W3mQuLjDafUGietRUqmeRz",
                "inactiveReasons": {
                    "primaryAccount": "missing"
                },
                "taxWithholdingPercentage": null,
                "taxForm": null,
                "taxFormStatus": null
            }
        },
        "rawHeaders": [
            "Date",
            "Tue, 25 Oct 2022 04:56:26 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "1626",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "74",
            "X-Rate-Limit-Reset",
            "1666673846",
            "Vary",
            "Origin",
            "ETag",
            "W/\"65a-y53m+fxS1qyAR0nvVn6hvq4FCHg\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.railz.io:443",
        "method": "POST",
        "path": "/v1/recipients/R-Jcw11J3yhCUR771KpA87Zz/offlinePayments",
        "body": {
            "externalId": "testOfflinePayment",
            "taxReportable": false,
            "amount": "10.00",
            "currency": "USD",
            "withholdingAmount": "2.40",
            "withholdingCurrency": "USD"
        },
        "status": 200,
        "response": {
            "ok": true,
            "offlinePayment": {
                "id": "OP-3WLWeNYD8H1X7tbSDgDpdk",
                "recipientId": "R-Jcw11J3yhCUR771KpA87Zz",
                "taxFormId": null,
                "entered": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "withholding": {
                    "value": "2.40",
                    "currency": "USD"
                },
                "equivalentWithholding": {
                    "value": "2.40",
                    "currency": "USD"
                },
                "amount": "10.00",
                "currency": "USD",
                "withholdingAmount": "2.40",
                "withholdingCurrency": "USD",
                "equivalentWithholdingAmount": "2.40",
                "equivalentWithholdingCurrency": "USD",
                "paymentId": null,
                "externalId": "testOfflinePayment",
                "memo": "",
                "payoutMethod": null,
                "tags": [],
                "taxReportable": false,
                "category": "services",
                "processedAt": "2022-10-25T04:56:26.646Z",
                "forceUsTaxActivity": false,
                "taxWithholdingReason": null,
                "equivalentUntaxedAmount": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "modifiedSinceCreation": false,
                "taxPaidByWithholdingAgents": "0",
                "status": "processed",
                "enteredAmount": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "updatedAt": "2022-10-25T04:56:26.646Z",
                "createdAt": "2022-10-25T04:56:26.646Z",
                "deletedAt": null
            }
        },
        "rawHeaders": [
            "Date",
            "Tue, 25 Oct 2022 04:56:26 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "1255",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "73",
            "X-Rate-Limit-Reset",
            "1666673846",
            "Vary",
            "Origin",
            "ETag",
            "W/\"4e7-ULKeFGWPr7F+kZOSKaHHYGIgX9Y\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.railz.io:443",
        "method": "PATCH",
        "path": "/v1/recipients/R-Jcw11J3yhCUR771KpA87Zz/offlinePayments/OP-3WLWeNYD8H1X7tbSDgDpdk",
        "body": {
            "taxReportable": true,
            "amount": "10.00",
            "currency": "USD",
            "withholdingAmount": "2.40",
            "withholdingCurrency": "USD"
        },
        "status": 200,
        "response": {
            "ok": true,
            "offlinePayment": {
                "id": "OP-3WLWeNYD8H1X7tbSDgDpdk",
                "recipientId": "R-Jcw11J3yhCUR771KpA87Zz",
                "taxFormId": null,
                "entered": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "withholding": {
                    "value": "2.40",
                    "currency": "USD"
                },
                "equivalentWithholding": {
                    "value": "2.40",
                    "currency": "USD"
                },
                "amount": "10.00",
                "currency": "USD",
                "withholdingAmount": "2.40",
                "withholdingCurrency": "USD",
                "equivalentWithholdingAmount": "2.40",
                "equivalentWithholdingCurrency": "USD",
                "paymentId": null,
                "externalId": "testOfflinePayment",
                "memo": "",
                "payoutMethod": null,
                "tags": [],
                "taxReportable": true,
                "category": "services",
                "processedAt": "2022-10-25T04:56:26.646Z",
                "forceUsTaxActivity": false,
                "taxWithholdingReason": null,
                "equivalentUntaxedAmount": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "modifiedSinceCreation": true,
                "taxPaidByWithholdingAgents": "0",
                "status": "processed",
                "enteredAmount": {
                    "value": "10.00",
                    "currency": "USD"
                },
                "updatedAt": "2022-10-25T04:56:27.056Z",
                "createdAt": "2022-10-25T04:56:26.646Z",
                "deletedAt": null
            }
        },
        "rawHeaders": [
            "Date",
            "Tue, 25 Oct 2022 04:56:27 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "1253",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "72",
            "X-Rate-Limit-Reset",
            "1666673846",
            "Vary",
            "Origin",
            "ETag",
            "W/\"4e5-A6emauuPGU+ncxfL18NHVc60d3k\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.railz.io:443",
        "method": "GET",
        "path": "/v1/recipients/R-Jcw11J3yhCUR771KpA87Zz/offline-payments?recipientId=R-Jcw11J3yhCUR771KpA87Zz&page=1&pageSize=10&search=",
        "body": "",
        "status": 200,
        "response": {
            "ok": true,
            "offlinePayments": [
                {
                    "id": "OP-3WLWeNYD8H1X7tbSDgDpdk",
                    "recipientId": "R-Jcw11J3yhCUR771KpA87Zz",
                    "taxFormId": null,
                    "entered": {
                        "value": "10.00",
                        "currency": "USD"
                    },
                    "withholding": {
                        "value": "2.40",
                        "currency": "USD"
                    },
                    "equivalentWithholding": {
                        "value": "2.40",
                        "currency": "USD"
                    },
                    "amount": "10.00",
                    "currency": "USD",
                    "withholdingAmount": "2.40",
                    "withholdingCurrency": "USD",
                    "equivalentWithholdingAmount": "2.40",
                    "equivalentWithholdingCurrency": "USD",
                    "paymentId": null,
                    "externalId": "testOfflinePayment",
                    "memo": "",
                    "payoutMethod": null,
                    "tags": [],
                    "taxReportable": true,
                    "category": "services",
                    "processedAt": "2022-10-25T04:56:26.646Z",
                    "forceUsTaxActivity": false,
                    "taxWithholdingReason": null,
                    "equivalentUntaxedAmount": {
                        "value": "10.00",
                        "currency": "USD"
                    },
                    "modifiedSinceCreation": true,
                    "taxPaidByWithholdingAgents": "0",
                    "status": "processed",
                    "enteredAmount": {
                        "value": "10.00",
                        "currency": "USD"
                    },
                    "updatedAt": "2022-10-25T04:56:27.056Z",
                    "createdAt": "2022-10-25T04:56:26.646Z",
                    "deletedAt": null
                }
            ],
            "meta": {
                "page": 1,
                "pages": 1,
                "records": 1
            }
        },
        "rawHeaders": [
            "Date",
            "Tue, 25 Oct 2022 04:56:27 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "1421",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "75",
            "X-Rate-Limit-Remaining",
            "71",
            "X-Rate-Limit-Reset",
            "1666673846",
            "Vary",
            "Origin",
            "ETag",
            "W/\"58d-q2NFQHwNhRDdRh1Etyx1iibo0yc\""
        ],
        "responseIsBinary": false
    }
]